// // задача 01. --------------------------------------------------------------------------
// // Напишите задачу, которая принимает на вход
// // трехзначное число и удаляет вторую цифру этого числа.
// // примеры
// // a = 256 => 26
// // a = 891 => 81

Console.Clear();
int n = new Random().Next(100, 1000);
Console.WriteLine("Random number is " + n);
int n1 = n / 100;
int n2 = n % 10;
int n3 = (n1 * 10) + n2;

Console.WriteLine("The number of 1st and the 3rd symbols is " + n3);
// ----------------------------------------------------------------------------------